src/Documents/СогласованиеЗакупочныхЦен.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>СогласованиеЗакупочныхЦен</Name>
			<Comment>Согласование закупочных цен</Comment>
			<BasedOn>
				<xr:Item>Document.ЗаказПоставщику</xr:Item>
				<xr:Item>Catalog.ПрайсЛистыКонтрагентов</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СостоянияДокументов</xr:Item>
				<xr:Item>InformationRegister.Цены</xr:Item>
				<xr:Item>InformationRegister.СогласованныеЦены</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Поставщик/комитент от которого мы получили товар</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействия</Name>
					<Comment>Срок действия протокола</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентОтклонения</Name>
					<Comment>Процент отклонения</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Comment>Дата начала действия</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>Документ, на основании которого введен данный</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Comment>Приоритет протокола</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦен</Name>
					<Comment>Тип цен закупки</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортфельКатегорий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПортфелиКатегорий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьОтклонения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаЗаказа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыЗаказов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
					<Comment>Таблица товаров и услуг</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>Номенклатура (товар, услуга и т.п.)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Comment>Единица измерения номенклатурной позиции</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Comment>Коэффициент пересчета по отношению к базовой единице номенклатуры</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Comment>Цена номенклатурной позиции</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаБезНДС</Name>
							<Comment>Цена номенклатурной позиции (без НДС)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Comment>Ставка НДС по номенклатурной позиции</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Флаг</Name>
							<Comment>флажок, который будет использоваться при установке поставщиков</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>блЦенаИзготовителя</Name>
							<Comment>Всегда указывается без налогов</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФлагОтклонено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КвантПоставки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МинимальныйЗаказ1</Name>
							<Comment>Минимальное количество к заказу</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МинимальныйЗаказ2</Name>
							<Comment>Минимальное количество к заказу (альтернативное)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Подразделения</Name>
					<Comment>Подразделения, для которых устанавливается цены</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПодразделениеКомпании</Name>
							<Comment>Подразделение компании для которого изменяется ассортимент данным документом</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ГруппыПоставки</Name>
					<Comment>Группы поставки, для которых устанавливается цены</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ГруппаПоставки</Name>
							<Comment>Группа поставки для которого изменяется ассортимент данным документом</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ГруппыПоставки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/InformationRegisters/СогласованныеЦены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>СогласованныеЦены</Name>
			<Comment>Согласование цен с контрагентами*</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Comment>Цена номенклатуры для контрагента</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаБезНДС</Name>
					<Comment>Цена номенклатуры для контрагента без учета налогов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>блЦенаИзготовителя</Name>
					<Comment>Всегда указывается без налогов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентОтклонения</Name>
					<Comment>Процент отклонения</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КвантПоставки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МинимальныйЗаказ1</Name>
					<Comment>Минимальное количество к заказу</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МинимальныйЗаказ2</Name>
					<Comment>Минимальное количество к заказу (альтернативное)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ГруппаЗаказа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыЗаказов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СрокДействия</Name>
					<Comment>Срок действия цен</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппаПоставки</Name>
					<Comment>Группа поставки</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПоставки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ВидыКонтроля.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыКонтроля</Name>
			<Comment>Виды контроля (для прав)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеКонтролировать</Name>
					<Comment>Не контролировать</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Предупреждать</Name>
					<Comment>Предупреждать</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Запрещать</Name>
					<Comment>Запрещать</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/СогласованиеЗакупочныхЦен/Ext/ObjectModule.bsl
// Модуль объекта документа "Согласование закупочных цен"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ЗАПОЛНЕНИЯ ОБЪЕКТА

// Производит заполнение объекта на основании документа "Прайс-листы контрагентов".
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_ПрайсЛистыКонтрагентов(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Вызываем общий обработчик заполнения.
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, 
			СтандартнаяОбработка) Тогда
			
		Возврат ИСТИНА;
	КонецЕсли;
	
	ПараметрыДействия = Новый Структура;
	
	Контрагент = ДанныеЗаполнения.Владелец;
	Документы.СогласованиеЗакупочныхЦен.КонтрагентПриИзменении(ЭтотОбъект, ПараметрыДействия);
	
	// заполним ТЧ "Товары" по прайс-листу
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	СтавкиНДС.Ставка КАК Ставка,
	|	МИНИМУМ(СтавкиНДС.Наименование) КАК Наименование
	|ПОМЕСТИТЬ
	|	СрезСтавок
	|ИЗ
	|	Справочник.СтавкиНДС КАК СтавкиНДС
	|СГРУППИРОВАТЬ ПО
	|	СтавкиНДС.Ставка
	|;
	|
	|ВЫБРАТЬ
	|	ТаблицаСтавкиНДС.Ставка КАК Ставка,
	|	ТаблицаСтавкиНДС.Ссылка
	|ПОМЕСТИТЬ
	|	СтавкиНДС
	|ИЗ
	|	СрезСтавок КАК СрезСтавок
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	Справочник.СтавкиНДС КАК ТаблицаСтавкиНДС
	|ПО
	|	СрезСтавок.Ставка = ТаблицаСтавкиНДС.Ставка И 
	|	СрезСтавок.Наименование = ТаблицаСтавкиНДС.Наименование
	|;
	|
	|ВЫБРАТЬ
	|	ПрайсЛистыКонтрагентов.Цена,
	|	ПрайсЛистыКонтрагентов.Номенклатура,
	|	ПрайсЛистыКонтрагентов.ЦенаБезНДС,
	|	ЕСТЬNULL(ТаблицаСтавкиНДС.Ссылка, ЗНАЧЕНИЕ(Справочник.СтавкиНДС.ПустаяСсылка)) КАК СтавкаНДС,
	|	ПрайсЛистыКонтрагентов.СтавкаНДС КАК Ставка,
	|	ПрайсЛистыКонтрагентов.ЦенаПроизводителя
	|ИЗ
	|	РегистрСведений.ПрайсЛистыКонтрагентов КАК ПрайсЛистыКонтрагентов
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	СтавкиНДС КАК ТаблицаСтавкиНДС
	|ПО
	|	ПрайсЛистыКонтрагентов.СтавкаНДС = ТаблицаСтавкиНДС.Ставка
	|ГДЕ
	|	ПрайсЛистыКонтрагентов.ПрайсЛист = &ПрайсЛист
	|	И ПрайсЛистыКонтрагентов.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)";
	Запрос.УстановитьПараметр("ПрайсЛист", ДанныеЗаполнения);
	
	ПустаяСтавкиНДС = Справочники.СтавкиНДС.ПустаяСсылка();
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Товары.Добавить();
		НоваяСтрока.Номенклатура = Выборка.Номенклатура;
		Документы.СогласованиеЗакупочныхЦен.ТоварыНоменклатураПриИзменении(ЭтотОбъект, НоваяСтрока, ПараметрыДействия);
		
		Если Выборка.СтавкаНДС = ПустаяСтавкиНДС Тогда
			ВывестиСообщение(НСтр("ru='Не найдена ставка НДС ""%1"".'"),,,,, Формат(Выборка.Ставка, "ЧДЦ=4; ЧС=2; ЧН=0"));
		КонецЕсли;
		
		НоваяСтрока.СтавкаНДС = Выборка.СтавкаНДС;
		Документы.СогласованиеЗакупочныхЦен.ТоварыСтавкаНДСПриИзменении(ЭтотОбъект, НоваяСтрока, ПараметрыДействия);
		
		Если ЗначениеЗаполнено(Выборка.ЦенаБезНДС) Тогда
			НоваяСтрока.ЦенаБезНДС = Выборка.ЦенаБезНДС;
			Документы.СогласованиеЗакупочныхЦен.ТоварыЦенаБезНДСПриИзменении(ЭтотОбъект, НоваяСтрока, ПараметрыДействия);
		КонецЕсли;
		
		//НоваяСтрока.блЦенаИзготовителя = Выборка.ЦенаПроизводителя;
		НоваяСтрока.Цена = Выборка.Цена;
		Документы.СогласованиеЗакупочныхЦен.ТоварыЦенаПриИзменении(ЭтотОбъект, НоваяСтрока, ПараметрыДействия);
	КонецЦикла;
	
	// Возвращаем признак возможности дальнейшей обработки события.
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения_ПрайсЛистыКонтрагентов()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМИРОВАНИЯ ДВИЖЕНИЙ ДОКУМЕНТА

// Возвращает выборку по шапке.
//
// Параметры:
//  ДокументСсылка - Ссылка на документ для которого получаем шапку.
//
// Возвращаемое значение:
//  Выборка - выборка по шапке.
//
Функция ПолучитьШапкуДокумента(ДокументСсылка)
	
	Запрос=Новый Запрос("
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Док.Ссылка КАК Ссылка,
	|	Док.Дата КАК Дата,
	|	Док.ВалютаДокумента КАК ВалютаДокумента,
	|	Док.КурсДокумента КАК КурсДокумента,
	|	Док.ТипЦен КАК ТипЦен,
	|	Док.ХозОперация КАК ХозОперация,
	|	Док.КурсВалютыУпр КАК КурсВалютыУпр,
	|	Док.МоментВремени КАК МоментВремени,
	|	Док.ПодразделениеКомпании КАК ПодразделениеКомпании,
	/////////// ПРИВАТ ////////////
	|	Док.Контрагент КАК Контрагент,
	|	Док.ДатаНачалаДействия КАК ДатаНачалаДействия,
	|	Док.СрокДействия КАК СрокДействия,
	|	Док.ПроцентОтклонения КАК ПроцентОтклонения,
	|	Док.Приоритет КАК Приоритет,
	|	Док.ДокументОснование КАК ДокументОснование
	|
	|ИЗ
	|	Документ.СогласованиеЗакупочныхЦен КАК Док
	|ГДЕ
	|	Док.Ссылка = &Ссылка
	|");
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Выборка = Запрос.Выполнить().Выбрать(); Выборка.Следующий();
	
	Возврат Выборка;
	
КонецФункции // ПолучитьШапкуДокумента()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Обработчик события заполнения объекта как при создании нового, так и при вводе на основании существующего.
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтотОбъект.ЭтоНовый() Тогда
		ЭтотОбъект.ТипЦен = ПравоПользователя("ОсновнойТипЦенЗакупки", ЭтотОбъект);
		
		Если НЕ ЗначениеЗаполнено(ДатаНачалаДействия) Тогда
			КолДней = ПравоПользователя("МинимальноеКоличествоДнейДоДатыНачалаСогласованныхЦен", ЭтотОбъект);
	
			ДатаНачалаДействия = Дата + (86400 * КолДней);
			СрокДействия       = ДобавитьМесяц(ДатаНачалаДействия, 12);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры //ОбработкаЗаполнения()

// Обработчик события заполнения объекта копированием.
//
// Параметры:
//  ОбъектКопирования - ДокументОбъект - Исходный объект, который является источником копирования.
//
Процедура ПриКопировании(ОбъектКопирования)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриКопировании()

// Обработчик события возникающего при необходимости проверки заполнения реквизитов при записи или при проведении.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от продолжения работы после выполнения проверки заполнения.
//  ПроверяемыеРеквизиты - Массив - Массив путей к реквизитам, для которых будет выполнена проверка заполнения.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты) Тогда
		Возврат;
	КонецЕсли;
	
	//Проверяем, что дата начала действия не ранее минимального периода дней от даты документа
	//КолДней = ПолучитьЗначениеУчетнойПолитики("МинимальныйПериодУстановкиСогласованныхЦен",, Дата);
	КолДней = ПравоПользователя("МинимальноеКоличествоДнейДоДатыНачалаСогласованныхЦен", ЭтотОбъект);
	
	Если ДатаНачалаДействия<НачалоДня(Дата+(86400*КолДней)) Тогда
		Отказ = Истина;
		ВывестиСообщение(НСтр("ru = 'До начала действия цен, должно быть не менее " + КолДней + " дней, от даты документа.'"), ЭтотОбъект,,,Отказ);
	КонецЕсли;
	
	КонтрольМинПериодаИзмЦен = ПравоПользователя("КонтрольМинимальногоПериодаИзмененийСогласованныхЦен", ЭтотОбъект);
	
	Если КонтрольМинПериодаИзмЦен<>Перечисления.ВидыКонтроля.НеКонтролировать Тогда
		//Проверяем, что не нарушен минимальный допустимый период изменения цен у поставщика
		Запрос = Новый Запрос;
		ТекстЗапроса = "
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	Регистратор.ДатаНачалаДействия КАК ПоследняяДатаЦены,
		|	Контрагент КАК Контрагент
		|ПОМЕСТИТЬ ДатаПоследнейЦены
		|ИЗ РегистрСведений.СогласованныеЦены.СрезПоследних(&Момент, Контрагент=&Контрагент И Приоритет=&Приоритет И Номенклатура В(&Номенклатура) И ПодразделениеКомпании В(&Массив))
		|УПОРЯДОЧИТЬ ПО Регистратор.ДатаНачалаДействия УБЫВ
		|;
		|ВЫБРАТЬ ПоследняяДатаЦены
		|ИЗ ДатаПоследнейЦены
		|ГДЕ РАЗНОСТЬДАТ(ПоследняяДатаЦены, &ДатаЦены, ДЕНЬ) < Контрагент.МинимальныйПериодИзмененияЦен";
		Момент = ?(Ссылка.Пустая(), Новый МоментВремени(КонецДня(ДатаНачалаДействия)), Новый Граница(Новый МоментВремени(ДатаНачалаДействия, Ссылка), ВидГраницы.Исключая));
		Запрос.УстановитьПараметр("Момент", Момент);
		Запрос.УстановитьПараметр("ДатаЦены", ДатаНачалаДействия);
		Запрос.УстановитьПараметр("Номенклатура", Товары.ВыгрузитьКолонку("Номенклатура"));
		Запрос.УстановитьПараметр("Контрагент", Контрагент);
		Запрос.УстановитьПараметр("Приоритет", Приоритет);
		Если ХозОперация=Справочники.ХозОперации.СогласованиеЗакупочныхЦенПоГруппамПоставки
			ИЛИ ХозОперация=Справочники.ХозОперации.СогласованиеЗакупочныхЦенПоГпПолное Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПодразделениеКомпании", "ГруппаПоставки");
			Запрос.УстановитьПараметр("Массив", ГруппыПоставки.ВыгрузитьКолонку("ГруппаПоставки"));
		Иначе
			Запрос.УстановитьПараметр("Массив", Подразделения.ВыгрузитьКолонку("ПодразделениеКомпании"));
		КонецЕсли;
		Запрос.Текст = ТекстЗапроса;
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ВывестиСообщение(НСтр("ru = 'Недопустимая периодичность изменения цен для контрагента. Дата предыдущего изменения: " + Формат(Выборка.ПоследняяДатаЦены, "ДЛФ=D") + ".'"), ЭтотОбъект);
			Отказ = Отказ ИЛИ (КонтрольМинПериодаИзмЦен=Перечисления.ВидыКонтроля.Запрещать);
		КонецЕсли;
	КонецЕсли;
	
	КонтрольПересечения = ПравоПользователя("КонтрольПересеченияСогласованныхЦенПоГруппамПоставки", ЭтотОбъект);
	
	Если КонтрольПересечения<>Перечисления.ВидыКонтроля.НеКонтролировать Тогда
		//Проверяем, что цены не пересекаются с другими поставщиками по группам поставки
		Запрос = Новый Запрос("
		|ВЫБРАТЬ
		|	тчТовары.Номенклатура
		|ПОМЕСТИТЬ СписокНоменклатуры
		|ИЗ
		|	&тчТовары КАК тчТовары
		|ГДЕ
		|	тчТовары.Цена<>0
		|	И НЕ тчТовары.ФлагОтклонено
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СогласованныеЦены.ПодразделениеКомпании КАК ПодразделениеКомпании,
		|	СогласованныеЦены.Номенклатура КАК Номенклатура,
		|	СогласованныеЦены.ГруппаПоставки КАК ГруппаПоставки,
		|	СогласованныеЦены.Контрагент КАК Контрагент,
		|	СогласованныеЦены.Приоритет КАК Приоритет,
		|	СогласованныеЦены.Период КАК ДатаНачалаДействия,
		|	СогласованныеЦены.СрокДействия КАК СрокДействия,
		|	СогласованныеЦены.Регистратор КАК Регистратор,
		|	СогласованныеЦены.Цена КАК СогласованнаяЦена
		|ПОМЕСТИТЬ ТаблицаСогласованныеЦены
		|ИЗ
		|	РегистрСведений.СогласованныеЦены КАК СогласованныеЦены
		|ГДЕ
		//|	((СогласованныеЦены.Период <= &ДатаНачалаДействия И СогласованныеЦены.СрокДействия >= &ДатаНачалаДействия)
		//|	ИЛИ (СогласованныеЦены.Период >= &ДатаНачалаДействия И СогласованныеЦены.Период <= &СрокДействия))
		|	((&ДатаНачалаДействия МЕЖДУ СогласованныеЦены.Период И СогласованныеЦены.СрокДействия)
		|	ИЛИ (СогласованныеЦены.Период МЕЖДУ &ДатаНачалаДействия И &СрокДействия))
		|	И СогласованныеЦены.Контрагент <> &Контрагент
		|	И СогласованныеЦены.Номенклатура В(ВЫБРАТЬ Номенклатура ИЗ СписокНоменклатуры)
		|	И СогласованныеЦены.ГруппаПоставки В(&ГруппыПоставок)
		|	И СогласованныеЦены.Регистратор <> &Регистратор
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СогласованныеЦены.ГруппаПоставки КАК ГруппаПоставки,
		|	СогласованныеЦены.Контрагент КАК Контрагент,
		|	СогласованныеЦены.Номенклатура КАК Номенклатура,
		|	СогласованныеЦены.ДатаНачалаДействия КАК ДатаНачалаДействия,
		|	СогласованныеЦены.СрокДействия КАК СрокДействия,
		|	СогласованныеЦены.СогласованнаяЦена КАК Цена
		|ИЗ
		|	ТаблицаСогласованныеЦены КАК СогласованныеЦены
		|ГДЕ
		|	СогласованныеЦены.Регистратор В
		|			(ВЫБРАТЬ ПЕРВЫЕ 1
		|				ТаблицаСогласованныеЦены.Регистратор КАК Регистратор
		|			ИЗ
		|				ТаблицаСогласованныеЦены КАК ТаблицаСогласованныеЦены
		|			ГДЕ
		|				ТаблицаСогласованныеЦены.Номенклатура = СогласованныеЦены.Номенклатура
		|				И ТаблицаСогласованныеЦены.Контрагент = СогласованныеЦены.Контрагент
		|				И ТаблицаСогласованныеЦены.ПодразделениеКомпании = СогласованныеЦены.ПодразделениеКомпании
		|				И ТаблицаСогласованныеЦены.ГруппаПоставки = СогласованныеЦены.ГруппаПоставки
		|			УПОРЯДОЧИТЬ ПО
		|				ТаблицаСогласованныеЦены.Приоритет УБЫВ,
		|				ТаблицаСогласованныеЦены.ДатаНачалаДействия УБЫВ,
		|				ТаблицаСогласованныеЦены.Регистратор.Дата УБЫВ,
		|				ТаблицаСогласованныеЦены.СрокДействия)
		|	И СогласованныеЦены.СогласованнаяЦена<>0
		|");
		
		Запрос.УстановитьПараметр("СрокДействия", СрокДействия);
		Запрос.УстановитьПараметр("ДатаНачалаДействия", ДатаНачалаДействия);
		Запрос.УстановитьПараметр("Контрагент", Контрагент);
		Запрос.УстановитьПараметр("ГруппыПоставок", ГруппыПоставки.ВыгрузитьКолонку("ГруппаПоставки"));
		Запрос.УстановитьПараметр("тчТовары", Товары.Выгрузить());
		Запрос.УстановитьПараметр("Регистратор", ЭтотОбъект.Ссылка);
		
		Рез = Запрос.Выполнить();
		Если НЕ Рез.Пустой() Тогда
			Отказ = Отказ ИЛИ (КонтрольПересечения=Перечисления.ВидыКонтроля.Запрещать);
		КонецЕсли;
		
		Выборка = Рез.Выбрать();
		Пока Выборка.Следующий() Цикл
			ВывестиСообщение(НСтр("ru = 'Для номенклатуры: [" + СокрЛП(Выборка.Номенклатура.Код) + "] " + Выборка.Номенклатура + ", по группе поставке: " + Выборка.ГруппаПоставки + ", уже имеется согласованная цена, с контрагентом: " + Выборка.Контрагент + ", на период (" + Формат(Выборка.ДатаНачалаДействия,"ДФ=dd.MM.yy") + " - " + Формат(Выборка.СрокДействия,"ДФ=dd.MM.yy") + ")'"), ЭтотОбъект);
		КонецЦикла;
		
	КонецЕсли;
	
	КонтрольГруппПоставки = ПравоПользователя("КонтрольГруппПоставкиПоКонтрагентуПриСогласованииЦен", ЭтотОбъект);
	
	Если КонтрольГруппПоставки<>Перечисления.ВидыКонтроля.НеКонтролировать Тогда
		Для Каждого текГрПоставки Из ГруппыПоставки Цикл
			Если Контрагент.ГруппыПоставки.Найти(текГрПоставки.ГруппаПоставки)=Неопределено Тогда
				ВывестиСообщение(НСтр("ru = 'Указанная группа поставки """ + СокрЛП(текГрПоставки.ГруппаПоставки) + """, отсуствует в списке контрагента.'"), ЭтотОбъект);
				
				Отказ = Отказ ИЛИ (КонтрольГруппПоставки=Перечисления.ВидыКонтроля.Запрещать);
			КонецЕсли;//ГруппаПоставки
		КонецЦикла;
	КонецЕсли;
	
	КонтрольПортфеля = ПравоПользователя("РедактированиеДокументаТолькоМенеджеромПортфеля", ЭтотОбъект);
	
	Если КонтрольПортфеля И Товары.Количество()>0 Тогда
		
		Если НЕ ЗначениеЗаполнено(ПортфельКатегорий) Тогда
			
			ВывестиСообщение(НСтр("ru = 'Необходимо указать портфель категорий.'"), ЭтотОбъект,,,Отказ);
			
		Иначе
			
			Если ПортфельКатегорий.КатегорииНоменклатуры.Количество()>0 Тогда
				Запрос = Новый Запрос("
				|ВЫБРАТЬ
				|	тчТовары.Номенклатура
				|ПОМЕСТИТЬ СписокНоменклатуры
				|ИЗ
				|	&тчТовары КАК тчТовары
				|;
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	Номенклатура
				|ИЗ
				|	СписокНоменклатуры КАК СписокНоменклатуры
				|ГДЕ
				|	НЕ Номенклатура В ИЕРАРХИИ(&МассивИзПортфеля)");
				Запрос.УстановитьПараметр("тчТовары", Товары.Выгрузить());
				Запрос.УстановитьПараметр("МассивИзПортфеля", ПортфельКатегорий.КатегорииНоменклатуры.ВыгрузитьКолонку("КатегорияНоменклатуры"));
				
				Рез = Запрос.Выполнить();
				Если НЕ Рез.Пустой() Тогда
					Отказ = Истина;
				КонецЕсли;
					
				Выборка = Рез.Выбрать();
				Пока Выборка.Следующий() Цикл
					ВывестиСообщение(НСтр("ru = 'Номенклатура: [" + СокрЛП(Выборка.Номенклатура.Код) + "] """ + Выборка.Номенклатура + """, не входит в указанный портфель категорий.'"), ЭтотОбъект);
				КонецЦикла;
			КонецЕсли;
			
			Если ПортфельКатегорий.ГруппыПоставки.Количество()>0 Тогда
				Запрос = Новый Запрос("
				|ВЫБРАТЬ
				|	тчГруппыПоставки.ГруппаПоставки
				|ПОМЕСТИТЬ СписокГруппПоставки
				|ИЗ
				|	&тчГруппыПоставки КАК тчГруппыПоставки
				|;
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ГруппаПоставки
				|ИЗ
				|	СписокГруппПоставки КАК СписокГруппПоставки
				|ГДЕ
				|	НЕ ГруппаПоставки В (&МассивИзПортфеля)");
				Запрос.УстановитьПараметр("тчГруппыПоставки", ГруппыПоставки.Выгрузить());
				Запрос.УстановитьПараметр("МассивИзПортфеля", ПортфельКатегорий.ГруппыПоставки.ВыгрузитьКолонку("ГруппаПоставки"));
				
				Рез = Запрос.Выполнить();
				Если НЕ Рез.Пустой() Тогда
					Отказ = Истина;
				КонецЕсли;
					
				Выборка = Рез.Выбрать();
				Пока Выборка.Следующий() Цикл
					ВывестиСообщение(НСтр("ru = 'Группа поставки: """ + Выборка.ГруппаПоставки + """, не входит в указанный портфель категорий.'"), ЭтотОбъект);
				КонецЦикла;
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

// Обработчик события возникающего после начала транзакции записи, но до начала записи объекта.
//
// Параметры:
//  Отказ           - Булево                   - Признак отказа от совершения операции.
//  РежимЗаписи     - РежимЗаписиДокумента     - Текущий режим записи документа.
//  РежимПроведения - РежимПроведенияДокумента - Текущий режим проведения.
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
	Если ДатаНачалаДействия >= СрокДействия Тогда
		ВывестиСообщение(НСтр("ru='Неправильно задан период действия протокола.'"), ЭтотОбъект,"СрокДействия",, Отказ);
	КонецЕсли;
	
	ЕстьОтклонения = Товары.Найти(Истина,"ФлагОтклонено")<>Неопределено;
	
КонецПроцедуры // ПередЗаписью()

// Обработчик события возникающего после записи объекта в базу данных, но до окончания транзакции записи.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПриЗаписи(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПриЗаписи(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриЗаписи()

// Обработчик события возникающего в транзакции удаления перед непосредственным удалением объекта из базы данных.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПередУдалением(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПередУдалением(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередУдалением()

// Обработчик события возникающего при отмене проведения документа. Выполняется в транзакции записи.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаУдаленияПроведения()

// Обработчик события возникающего в транзакции записи для формирования движений документу по подчиненным регистрам.
//
// Параметры:
//  Отказ           - Булево                   - Признак отказа от совершения операции.
//  РежимПроведения - РежимПроведенияДокумента - Текущий режим проведения.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
	СогласованиеПоГруппамПоставки = (ХозОперация=Справочники.ХозОперации.СогласованиеЗакупочныхЦенПоГруппамПоставки) ИЛИ (ХозОперация=Справочники.ХозОперации.СогласованиеЗакупочныхЦенПоГпПолное);
	
	Если СогласованиеПоГруппамПоставки Тогда
		МассивСогласования = ГруппыПоставки.ВыгрузитьКолонку("ГруппаПоставки");
		Если МассивСогласования.Количество()=0 Тогда
			Если ЗначениеЗаполнено(ПодразделениеКомпании.ГруппаПоставки) Тогда
				МассивСогласования.Добавить(ПодразделениеКомпании.ГруппаПоставки);
			Иначе
				Отказ = Истина;
				ВывестиСообщение(НСтр("ru='Не удалось определить группу поставки.'"), ЭтотОбъект, "ГруппаПоставки",, Отказ);
				Возврат;
			КонецЕсли;
		КонецЕсли;
	Иначе
		МассивСогласования = Подразделения.ВыгрузитьКолонку("ПодразделениеКомпании");
		Если МассивСогласования.Количество()=0 Тогда
			МассивСогласования.Добавить(ПодразделениеКомпании);
		КонецЕсли;
	КонецЕсли;
	
	//Формируем выборку по таб. части документа
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	СогласованиеЗакупочныхЦенТовары.Номенклатура КАК Номенклатура,
	|	СогласованиеЗакупочныхЦенТовары.Цена КАК Цена,
	|	СогласованиеЗакупочныхЦенТовары.Цена КАК НоваяЦена,
	|	СогласованиеЗакупочныхЦенТовары.ЦенаБезНДС КАК ЦенаБезНДС,
	|	СогласованиеЗакупочныхЦенТовары.блЦенаИзготовителя КАК блЦенаИзготовителя,
	|	СогласованиеЗакупочныхЦенТовары.МинимальныйЗаказ1 КАК МинимальныйЗаказ1,
	|	СогласованиеЗакупочныхЦенТовары.МинимальныйЗаказ2 КАК МинимальныйЗаказ2,
	|	СогласованиеЗакупочныхЦенТовары.КвантПоставки КАК КвантПоставки
	|ИЗ
	|	Документ.СогласованиеЗакупочныхЦен.Товары КАК СогласованиеЗакупочныхЦенТовары
	|ГДЕ
	|	СогласованиеЗакупочныхЦенТовары.Ссылка = &ДокументСсылка
	|	И НЕ СогласованиеЗакупочныхЦенТовары.ФлагОтклонено");
	Запрос.УстановитьПараметр("ДокументСсылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	РезультатЗапросаСЦ = РезультатЗапроса;
	
	Если СогласованиеПоГруппамПоставки Тогда
		тзПрочихСогЦен = Новый ТаблицаЗначений;
		тзПрочихСогЦен.Колонки.Добавить("ГруппаПоставки", Новый ОписаниеТипов("СправочникСсылка.ГруппыПоставки"));
		тзПрочихСогЦен.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		тзОтклонений = тзПрочихСогЦен;
		
		Если ХозОперация=Справочники.ХозОперации.СогласованиеЗакупочныхЦенПоГпПолное Тогда
			Запрос = Новый Запрос("
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ГруппаПоставки,
			|	Номенклатура
			|ИЗ
			|	РегистрСведений.СогласованныеЦены
			|ГДЕ
			|	ГруппаПоставки В(&ГруппыПоставки)
			//|	И ГруппаЗаказа = &ГруппаЗаказа
			|	И Номенклатура НЕ В(&Номенклатура)
			|	И Контрагент = &Контрагент 
			|	И СрокДействия >= &Дата
			|	И Период <= &Дата");
			Запрос.УстановитьПараметр("ГруппыПоставки", ГруппыПоставки.ВыгрузитьКолонку("ГруппаПоставки"));
			//Запрос.УстановитьПараметр("ГруппаЗаказа",	ГруппаЗаказа);
			Запрос.УстановитьПараметр("Номенклатура",	Товары.ВыгрузитьКолонку("Номенклатура"));
			Запрос.УстановитьПараметр("Контрагент",		Контрагент);
			Запрос.УстановитьПараметр("Дата",			ДатаНачалаДействия);// - 1);
			тзПрочихСогЦен = Запрос.Выполнить().Выгрузить();
		КонецЕсли;
		
		//Если ЕстьОтклонения Тогда
		//	Запрос = Новый Запрос("
		//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
		//	|	Номенклатура
		//	|ИЗ
		//	|	Документ.СогласованиеЗакупочныхЦен.Товары
		//	|ГДЕ
		//	|	Ссылка = &ДокументСсылка
		//	|	И ФлагОтклонено");
		//	Запрос.УстановитьПараметр("ДокументСсылка", Ссылка);
		//	тзОтклонений = Запрос.Выполнить().Выгрузить();
		//КонецЕсли;
	КонецЕсли;
	
	
	ТипЦенНеРассчитывается = (НЕ ТипЦен.Рассчитывается);
		
	Для Каждого ТекущееСогласование Из МассивСогласования Цикл
		
		Если СогласованиеПоГруппамПоставки И (тзПрочихСогЦен.Количество()>0 ИЛИ тзОтклонений.Количество()>0) Тогда
			Запрос = Новый Запрос("
			|ВЫБРАТЬ
			|	ВнешнийИсточник1.Номенклатура,
			|	ВнешнийИсточник1.Цена,
			|	ВнешнийИсточник1.ЦенаБезНДС,
			|   ВнешнийИсточник1.блЦенаИзготовителя,
			|	ВнешнийИсточник1.МинимальныйЗаказ1 КАК МинимальныйЗаказ1,
			|	ВнешнийИсточник1.МинимальныйЗаказ2 КАК МинимальныйЗаказ2,
			|	ВнешнийИсточник1.КвантПоставки КАК КвантПоставки
			|ПОМЕСТИТЬ СогласованныеЦены
			|ИЗ &ВнешнийИсточник1 КАК ВнешнийИсточник1
			|;
			|ВЫБРАТЬ
			|	ВнешнийИсточник2.Номенклатура,
			|	0 КАК Цена,
			|	0 КАК ЦенаБезНДС,
			|	0 КАК блЦенаИзготовителя,
			|	0 КАК МинимальныйЗаказ1,
			|	0 КАК МинимальныйЗаказ2,
			|	0 КАК КвантПоставки
			|ПОМЕСТИТЬ ПрочиеЦены
			|ИЗ &ВнешнийИсточник2 КАК ВнешнийИсточник2
			|ГДЕ ВнешнийИсточник2.ГруппаПоставки=&ГруппаПоставки
			|;
			|ВЫБРАТЬ
			|	ВнешнийИсточник3.Номенклатура,
			|	0 КАК Цена,
			|	0 КАК ЦенаБезНДС,
			|   0 КАК блЦенаИзготовителя,
			|	0 КАК МинимальныйЗаказ1,
			|	0 КАК МинимальныйЗаказ2,
			|	0 КАК КвантПоставки
			|ПОМЕСТИТЬ ОтклоненныеЦены
			|ИЗ &ВнешнийИсточник3 КАК ВнешнийИсточник3
			|;
			|ВЫБРАТЬ * ИЗ СогласованныеЦены
			|ОБЪЕДИНИТЬ ВСЕ
			|ВЫБРАТЬ * ИЗ ПрочиеЦены
			|ОБЪЕДИНИТЬ ВСЕ
			|ВЫБРАТЬ * ИЗ ОтклоненныеЦены");
			Запрос.УстановитьПараметр("ВнешнийИсточник1", РезультатЗапроса);
			Запрос.УстановитьПараметр("ВнешнийИсточник2", тзПрочихСогЦен);
			Запрос.УстановитьПараметр("ВнешнийИсточник3", тзОтклонений);
			Запрос.УстановитьПараметр("ГруппаПоставки", ТекущееСогласование);
			
			РезультатЗапросаСЦ = Запрос.Выполнить().Выгрузить();
		КонецЕсли;
		
		НаборЗаписейСогласованияЦен = Движения.СогласованныеЦены;
		НаборЗаписейСогласованияЦен.ДокументОбъект				= ЭтотОбъект;
		НаборЗаписейСогласованияЦен.Контрагент					= Контрагент;
		НаборЗаписейСогласованияЦен.ПодразделениеКомпании		= ?(СогласованиеПоГруппамПоставки, Неопределено, ТекущееСогласование);
		НаборЗаписейСогласованияЦен.ГруппаПоставки				= ?(СогласованиеПоГруппамПоставки, ТекущееСогласование, Неопределено);
		НаборЗаписейСогласованияЦен.ГруппаЗаказа				= ГруппаЗаказа;
		НаборЗаписейСогласованияЦен.СрокДействия				= СрокДействия;
		НаборЗаписейСогласованияЦен.ДатаНачалаДействия			= ДатаНачалаДействия;
		НаборЗаписейСогласованияЦен.Приоритет					= Приоритет;
		НаборЗаписейСогласованияЦен.ПроцентОтклонения			= ПроцентОтклонения;
		НаборЗаписейСогласованияЦен.РезультатЗапросаПоТоварам	= РезультатЗапросаСЦ;
		Отказ = НЕ НаборЗаписейСогласованияЦен.УстановитьЦены() ИЛИ Отказ;
		
		ТекущееПодразделение = ?(СогласованиеПоГруппамПоставки, ПодразделениеКомпании, ТекущееСогласование);
		
		// Установим закупочные цены компании
		Если НЕ Отказ И ТипЦенНеРассчитывается И ТекущееПодразделение.УстановкаЦенПротоколамиСогласования Тогда
			НаборЗаписейЦены = Движения.Цены;
			НаборЗаписейЦены.ДокументОбъект            = ЭтотОбъект;
			НаборЗаписейЦены.Контрагент                = Неопределено;
			НаборЗаписейЦены.ТипЦен                    = ТипЦен;
			НаборЗаписейЦены.ДатаНачалаДействия			= ДатаНачалаДействия;
			НаборЗаписейЦены.ИмяРеквизитаЦена          = "Цена";
			НаборЗаписейЦены.ПодразделениеКомпании     = ТекущееПодразделение;
			НаборЗаписейЦены.РезультатЗапросаПоТоварам = РезультатЗапроса;
			НаборЗаписейЦены.ВыгружатьВОборудованиеПриИзменении = Истина;
			Отказ = НЕ НаборЗаписейЦены.УстановитьЦены() ИЛИ Отказ;
		КонецЕсли;
		
		// Установим цены контрагентов
		Если НЕ Отказ И ТипЦенНеРассчитывается И ЗначениеЗаполнено(Контрагент) И ТекущееПодразделение.УстановкаЦенКонтрагентовПротоколамиСогласования Тогда
			НаборЗаписейЦены = Движения.Цены;
			НаборЗаписейЦены.ДокументОбъект            = ЭтотОбъект;
			НаборЗаписейЦены.Контрагент                = Контрагент;
			НаборЗаписейЦены.ТипЦен                    = ТипЦен;
			НаборЗаписейЦены.ДатаНачалаДействия			= ДатаНачалаДействия;
			НаборЗаписейЦены.ИмяРеквизитаЦена          = "Цена";
			НаборЗаписейЦены.ПодразделениеКомпании     = ТекущееПодразделение;
			НаборЗаписейЦены.РезультатЗапросаПоТоварам = РезультатЗапроса;
			НаборЗаписейЦены.ВыгружатьВОборудованиеПриИзменении = Ложь;
			Отказ = НЕ НаборЗаписейЦены.УстановитьЦены() ИЛИ Отказ;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ОбработкаПроведения()

#КонецЕсли
